## Redis & Memcached
인메모리 키-값 저장소. 캐시 엔진.

### Redis
- Memcached에 비해 Redis는 다양한 데이터 포맷을 제공한다.(String, Bitmap, Hash, List, Set, Sorted Set 등)
- 다양한 API를 지원한다.
- 인 메모리 데이터 세트를 정렬하거나 순위를 지정해야 하는 경우
- 트랜잭션의 특징을 지원한다.
- 메시징 솔루션으로 Pub/Sub 지원
- 백업 및 복원 기능이 필요한 경우 (스냅샷)
- 여러 데이터베이스를 지원해야 하는 경우
- 싱글스레드
- NoSQL
- 단점 : 메모리 사용 증가

### Memcached
- memcached는 DB / API 통신을 줄이기 위해 데이터를 캐싱처리하는 데에 사용하면 좋은 캐시이다.
- 상대적으로 작고 정적인 데이터를 캐싱하는 경우
- 여러 코어 또는 스레드가 있는 멀티 스레드의 경우
- 메모리 관리가 redis만큼 정교하지는 않지만, 메타 데이터에 대한 메모리 리소스를 비교적 적게 소비하여 간단한 사용에 적합하다.
- 캐시 관리에 LRU 알고리즘을 사용한다.
- 단점 : 데이터 타입과 API가 다양하지 않다.
